I can confirm and reproduce the issue. Either change parameters on the App Service Plan which requires recreation or moving to a new App Service Plan resource will recognized as in-place update by Terraform plan:
` # azurerm_logic_app_standard.example will be updated in-place
  ~ resource "azurerm_logic_app_standard" "example" {
      ~ app_service_plan_id            = "/subscriptions/4c713b6e-2479-48bb-ab84-0b932c0a276b/resourceGroups/azure-functions-test-rg/providers/Microsoft.Web/serverfarms/example" -> (known after apply)
        id                             = "/subscriptions/4c713b6e-2479-48bb-ab84-0b932c0a276b/resourceGroups/azure-functions-test-rg/providers/Microsoft.Web/sites/test-azure-functions-rsc"
        name                           = "test-azure-functions-rsc"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_service_plan.example must be replaced
-/+ resource "azurerm_service_plan" "example" {
      ~ id                           = "/subscriptions/4c713b6e-2479-48bb-ab84-0b932c0a276b/resourceGroups/azure-functions-test-rg/providers/Microsoft.Web/serverfarms/example" -> (known after apply)
      ~ kind                         = "elastic" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "example" -> "example2" # forces replacement
      ~ reserved                     = true -> (known after apply)
      - tags                         = {} -> null
      ~ worker_count                 = 1 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (5 unchanged attributes hidden)
    }`